<template>
  <main>
    <img :src="result[personality].img" :alt="result[personality].title">
    <h1>{{result[personality].title}}</h1>
    <p v-html="result[personality].description"></p>
    <Button
      text="다시 테스트하기"
      :clickEvent="resetPage"
    />
  </main>
</template>

<script>
export default {
  data() {
    return {
      personality: null,
      result: {
        enfp: {
          img: "/hyssop.jpg",
          title: "우슬초",
          description: "개방적이고 사교적이며 긍정 에너지를 분출하는 당신은 푸른빛, 붉은빛 향기로운 꽃을 피우는 우슬초와 닮았습니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        enfj: {
          img: "/cedar.jpg",
          title: "백향목",
          description: "열정적인 리더형인 당신은 거센 바람에도 끄떡없는 백향목처럼 확고한 천국 소망을 갖고 인류 구원에 앞장섭니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        entp: {
          img: "/shittim.jpg",
          title: "싯딤나무",
          description: "당신은 타인의 말과 시선에 흔들리지 않고 올곧게 믿음의 길을 가는 타입입니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        entj: {
          img: "/mustard.jpg",
          title: "겨자나무",
          description: "당신은 장기적 목표에 집중하고 실행에도 적극적인, 뛰어난 리더의 기질을 가진 지도자 타입입니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        esfp: {
          img: "/lily.jpg",
          title: "백합화",
          description: "남다른 에너지로 형제자매에게 즐거움을 선사하며 행복과 기쁨을 느끼는 당신은 시온의 사랑스러운 팔방미인입니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        esfj: {
          img: "/wheat.jpg",
          title: "밀",
          description: "당신은 배려심과 온정이 넘치고, 자신을 내세우기보다 형제자매를 섬기며 희생하기를 망설이지 않습니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        estp: {
          img: "/pomegranate.jpg",
          title: "석류나무",
          description: "자신감이 넘치고 사교적이어서 시온 분위기를 밝고 활기차게 만드는 당신은 석류나무 유형입니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        estj: {
          img: "/palm.jpg",
          title: "종려나무",
          description: "시온 안에서 형제자매가 연합하는 일에 앞장서며, 하나님의 규례를 소중하게 지키고 많은 이를 구원으로 인도하는 데도 열심인 당신은 모범적인 관리자이자 지도자 타압입니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        }
        ,infp: {
          img: "/tamarisk.jpg",
          title: "에셀나무",
          description: "자신에 대한 성찰과 주변 사람에 대한 공감 능력을 가진 당신은 에셀나무같은 성품이군요.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        infj: {
          img: "/myrrh.jpg",
          title: "몰약나무",
          description: "당신은 치유력이 있는 몰약나무 진액처럼 형제자매의 상처를 어루만지며 덧나지 않도록 보듬을 줄 압니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        intp: {
          img: "/olive.jpg",
          title: "감람나무",
          description: "어디서든지 잘 적응하며 자신만의 신앙생활을 해나가는 당신은 하나님의 인자하심을 의지하는 감람나무 같습니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        intj: {
          img: "/fig.jpg",
          title: "무화과나무",
          description: "무화과나무 유형인 당신은 겉으로는 조용해 보여도 상상력이 풍부하며 내면에 굳건한 신념과 비전을 품고 있습니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        isfp: {
          img: "/willow.jpg",
          title: "버드나무",
          description: "따뜻한 물가에서 물기를 머금고 자라는 버드나무처럼, 당신은 영혼의 생명수인 하나님 말씀을 가까이하며 살아갑니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        isfj: {
          img: "/broom.jpg",
          title: "로뎀나무",
          description: "로뎀나무 유형인 당신은 항상 겸손한 자세로 묵묵히 헌신합니다. 또한 성격이 세심해서 형제자매를 잘 배려하며 이들의 어려움을 좌시하지 않습니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        istp: {
          img: "/myttle.jpg",
          title: "화석류나무",
          description: "하나님께 다향한 은사를 허락받아 시온 곳곳에서 봉사하는 만능 재주꾼인 당신인 화석류나무 유형입니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        },
        istj: {
          img: "/grape.jpg",
          title: "포도나무",
          description: "어떤 환경에서도 불평불만 하지 않고 복음의 책이과 의무를 다하는 당신은, 비옥한 토양뿐 아니라 척박한 땅에서도 알알이 열매를 결실하는 포도나무 같습니다.<br><br>별 이웃 불러 하나 가난한 나의 봅니다. 불러 이름자를 밤을 하나에 어머니, 청춘이 다하지 별들을 북간도에 거외다. 무성할 이름을 내 버리었습니다.<br><br>비둘기, 마디씩 아이들의 까닭입니다. 딴은 내린 하나 쉬이 봅니다. 가슴속에 나의 내 불러 다 아스라히 책상을 있습니다. 하나에 못 이름을 강아지, 소녀들의 청춘이 새겨지는 별을 아침이 까닭입니다."
        }
      }
    }
  },
  created() {
    this.personality = this.$route.params.personality;

    if(this.result[this.$route.params.personality] === undefined) {
      this.$router.push({name: "index"});
    }
  },
  methods: {
    resetPage() {
      this.$store.dispatch('clickResetButton');
      this.$store.state.page = 0;
      this.$router.push({name: "index"});
    }
  }
}
</script>

<style>
  p {
    margin-bottom: 40px;
  }
</style>